Revit 2026 API
GlobalParametersManager.AreGlobalParametersAllowed Method
 Tests whether global parameters are allowed in the given document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public static bool AreGlobalParametersAllowed(
	Document document
)
Public Shared Function AreGlobalParametersAllowed (
	document As Document
) As Boolean
public:
static bool AreGlobalParametersAllowed(
	Document^ document
)
static member AreGlobalParametersAllowed :
        document : Document -> bool
Parameters
document Document
 A revit document of interest.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 First of all, global parameters can be had in main project documents only; they are not supported in family documents. However, there may also be other circumstances due to which global parameters may be disallowed in a particular project, either temporarily or permanently.
See Also
Reference
GlobalParametersManager Class
Autodesk.Revit.DB Namespace